:PROPERTIES:
:ID:       f5d85255-1e37-41cb-b961-7c1a6992fc97
:END:
#+TITLE: Characteristic functions
#+FILETAGS: :problem: :SPOP: :statmech:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+BEGIN: clocktable :maxlevel 2 :scope file :emphasize nil
#+CAPTION: Clock summary at [2024-04-17 Wed 19:32]
| Headline                     | Time   |
|------------------------------+--------|
| *Total time*                 | *4:44* |
|------------------------------+--------|
| 2.1 Characteristic functions | 4:44   |
#+END
* 2.1 Characteristic functions
:LOGBOOK:
CLOCK: [2024-04-12 Fri 11:15]--[2024-04-12 Fri 15:59] =>  4:44
:END:
*Calculate the characteristic function, the mean, and the variance of the following probability density functions.*

Next: [[id:70bdc644-aa9c-4b05-88f7-9c4e5cbe9f3e][Directed random walk]]

The characteristic function is the Fourier transform of the PDF [cite:@kardar2007spop]

\begin{align*}
\tilde{p}(k)=\left\langle\mathrm{e}^{-\mathrm{i} k x}\right\rangle=\int \mathrm{d} x p(x) \mathrm{e}^{-\mathrm{i} k x} .
\end{align*}

Once we have the characteristic function, the moments of the distribution can be read off from the expansion of \(\tilde{p}(k)\) in powers of \(k\) [cite:@kardar2007spop]

\begin{align*}
\tilde{p}(k)=\left\langle\sum_{n=0}^{\infty} \frac{(-\mathrm{i} k)^n}{n !} x^n\right\rangle=\sum_{n=0}^{\infty} \frac{(-\mathrm{i} k)^n}{n !}\left\langle x^n\right\rangle.
\end{align*}

** 2.1.1 Uniform
\[ p(x) = \frac{1}{2a} \quad \text{for} \quad -a < x < a, \quad \text{and} \quad p(x) = 0 \quad \text{otherwise}. \]

The characteristic function is

\begin{aligned}
\tilde{p}(k) & \equiv \int p(x) \exp [-i k x] \mathrm{~d} x =\int_{-a}^a \frac{1}{2 a} \exp [-i k x]  \mathrm{~d} x \\
&\qquad =\frac{1}{2 i k a}[\exp (i k a)-\exp (-i k a)] \\
&\qquad =\frac{\sin (a k)}{a k} = \sum_{n=0}^{\infty} \frac{(- i k)^{2n}}{(2n) !} \bigg( \frac{a^{2n}}{2n + 1} \bigg).
\end{aligned}

We thus have \(m_1=\langle x\rangle=0\) and  \(\qquad m_2= \langle x^2 \rangle=a^{2} / 3\).
** 2.1.2 Laplace
\[ p(x) = \frac{1}{2a} \exp \left( -\frac{|x|}{a} \right), \qquad - \infty < x < \infty \]

The characteristic function is

\begin{aligned}
& \tilde{p} (k)=\frac{1}{2 a}\left[\int_{-\infty}^0 \exp \left(-i k x+\frac{x}{a}\right) d x+\int_0^{\infty} \exp \left(-i k x - \frac{x}{a}\right) d x\right] \\
&\quad =\frac{1}{2 a}\left[\frac{1}{-i k+1 / a}+\frac{1}{i k+1 / a}\right]=\frac{1}{1+(a k)^2} \\
&\qquad = \sum_{n=0}^{\infty} \frac{(- i k)^{2n}}{(2n)!} \big[ a^{2n} (2n)! \big]\\
\end{aligned}

Hence, \(m_{1} = \langle x \rangle = 0\), and \(m_{2} = \langle x^{2} \rangle = 2 a^{2} \).
** 2.1.3 Cauchy
\[ p(x) = \frac{a}{\pi(x^2 + a^2)} \]

The characteristic function is

\begin{aligned}
\tilde{p} (k) & = \frac{1}{2 \pi} \int_{-\infty}^{\infty} \exp (-i k x)\left[\frac{1}{- i x + a} + \frac{1}{i x + a}\right] d x
\end{aligned}

We know that the PDF can be recovered from the characteristic function through the inverse Fourier transform

\begin{align*}
p(x)=\frac{1}{2 \pi} \int \mathrm{d} k \exp (i k x) \tilde{p}(k) .
\end{align*}

so on applying the transformation \(x \to - y\) to the expression for \(\tilde{p} (k)\) for the Cauchy PDF

\begin{aligned}
\tilde{p} (k) & = \frac{1}{2 \pi} \int_{-\infty}^{\infty} \exp (i k y)\left[\frac{1}{- i y + a} + \frac{1}{i y + a}\right] d y,
\end{aligned}

it is now clear that \(\tilde{p} (k)\) is the inverse Fourier transform of characteristic function of the (unnormalized) Laplace PDF we encountered in (2.1.2). We can thus immediately write \(\tilde{p} (k)=\exp (-|k a|)\). \(\tilde{p} (k)\) cannot be expanded in a Taylor series about \(k=0\) because it is not an [[id:432be539-cd8c-4bc5-ad10-45091801426b][Analytic function]]. We thus resort to using the definition of [[id:0aa35d43-6356-4910-a842-4ed740377570][Moments]]

\begin{align*}
m_1 = \langle x\rangle = \int_{-\infty}^{\infty} \frac{a x}{x^2+a^2} d x = 0,
\end{align*}

\begin{align*}
m_2= \langle x^2 \rangle=\int_{-\infty}^{\infty} \frac{a}{\pi} \frac{x^2}{\left(x^2+a^2\right)} d x.
\end{align*}

For the first moment we have used the fact that the integrand in an odd function of \(x\). The second moment is undefined because the integrand is not Lebesgue integrable.
** 2.1.4 Rayleigh
\[ p(x) = \frac{x}{a^2} \exp \left( -\frac{x^2}{2a^2} \right), \qquad x \geq 0 \]

The characteristic function is

\begin{aligned}
\tilde{p}(k)=\int_0^{\infty}[\cos (k x)-i \sin (k x)] \thinspace \frac{x}{a^2} \exp \left(-\frac{x^2}{2 a^2}\right) d x
\end{aligned}

Let us define

\begin{aligned}
& A(k) \equiv \int_0^{\infty} \cos (k x) \frac{x^2}{a^2} \exp \left(\frac{-x^2}{2 a^2}\right) d x, \\
& B(k) \equiv-i \int_0^{\infty} \sin (k x) \frac{x}{\lambda^2} \exp \left(\frac{-x^2}{2 \lambda^2}\right) d x. \\
\end{aligned}

First we evaluate \(A(k)\)

\begin{aligned}
A(k) &= \int_0^{\infty} \frac{x}{a^2} \cos (k x) \exp \left(\frac{-x^2}{2 a^2}\right) d x \\
& = - \cos (k x) \exp \left(\frac{-x^2}{2 a^2}\right) \bigg \rvert_0 ^{\infty} - \int_0^{\infty} \sin (k x) \cdot k \cdot \exp \left(\frac{-x^2}{2 a^2}\right) d x\\
& =1 - k \int_0^{\infty} \sin (k x) \exp \left(\frac{-x^2}{2 a^2}\right) d x.
\end{aligned}

To proceed, we transform \(x\) as \(x \to at / 2^{1/2}\) and \(k \to 2^{1/2} k / a\) to obtain

\begin{align*}
A(k) & =1 - k \int_0^{\infty} \sin \big(k t \big) \exp \big(-t^2 / 4\big) d t.
\end{align*}

Now we identify the second term as the Dawson function so that \(A(k) & =1 - 2 k \thinspace D (k)\). The Dawson function is related to the error function \(D_{+}(k) = \frac{\pi^{1/2}}{2} \exp (-k^2) \operatorname{erfi} (k)\), thus we have

\begin{aligned}
A(k) = 1 - a k \sqrt{\frac{\pi}{2}} \exp \big[-(a k)^{2} / 2 \big] \operatorname{erfi} \bigg(\frac{a k}{2^{1/2}}\bigg).
\end{aligned}

Moving on to evaluating \(B(k)\),

\begin{aligned}
B(k) &=\int_0^{\infty} \sin (k x) \frac{x}{a^2} \exp \left(\frac{-x^2}{2 a^2}\right) d x \\
&= - \left.\sin (k x) \exp \left(\frac{-x^2}{2 a^2}\right)\right|_0 ^{\infty} + k \int_0^{\infty} \cos (k x) \exp \left(\frac{-x^2}{2 a^2}\right) d x \\
&= \frac{k}{2} \int_{-\infty}^{\infty} \cos (k x) \exp \left(\frac{-x^2}{2 a^2}\right) d x.
\end{aligned}

Let \(C(k)=\int_{-\infty}^{\infty} \cos (k x) \exp \left(\frac{-x^2}{2 a^2}\right) d x\). Using the [[id:d993201b-c7d1-4402-b55d-c2a76a3f2530][Leibniz integral rule]], we have

\begin{aligned}
C^{\prime}(k) & =\frac{2 a^2}{2} \sin (k x) \exp \bigg(\frac{-x^2}{2 a^2}\bigg) \bigg \rvert_{0}^{\infty} - a^2 k \int_{-\infty}^{\infty} \exp \left(\frac{-x^2}{2 a^2}\right) \cos (k x) d x \\
& =-a^2 k C(k).
\end{aligned}

Therefore \(C(k) & =C(0) \exp \big(-a^{2} k^{2}/2\big)\) where \(C(0) = 2 a \sqrt{\frac{\pi}{2}}\). Substituting in the expression for \(B(k)\) we have \(B(k) = a k \thinspace \sqrt{\frac{\pi}{2}} \exp \big[-(a k)^{2}/2\big]\). Finally, since \(\tilde{p}(k) = A(k) - i B(k)\), we arrive at the characteristic function of the Rayleigh PDF

\begin{aligned}
\tilde{p}(k) = 1 - a k \thinspace  \exp \bigg(- \frac{a^{2} k^{2}}{2} \bigg) \sqrt{\frac{\pi}{2}} \bigg[ \operatorname{erfi} \bigg(\frac{a k}{\sqrt{2}}\bigg) + i \bigg].
\end{aligned}

We resort to using the definition of [[id:0aa35d43-6356-4910-a842-4ed740377570][Moments]] to evaluate \(m_{1}\) and \(m_{2}\):

\begin{align*}
m_1 = \langle x \rangle = \int_0^{\infty} \frac{x^2}{a^2} \exp \left( \frac{-x^2}{2a^2} \right) dx = \frac{1}{2} \int_{-\infty}^{\infty} \frac{x^2}{a^2} \exp \left( \frac{-x^2}{2a^2} \right) dx = a \sqrt{\frac{\pi}{2}},
\end{align*}

\begin{align*}
m_2 &= \langle x^2 \rangle = \int_0^{\infty} \frac{x^3}{a^2} \exp \left( \frac{-x^2}{2a^2} \right) dx  \qquad \bigg(\frac{x^2}{2a^2} \to u \bigg) \\
&= 2a^2 \left[ \int_0^{\infty} u^2 \exp(-u) du \right] = 2a^2 \left[ \int_0^{\infty} u \exp(cu) du \right] \bigg \rvert_{c = -1} \\
&= 2a^2 \thinspace \partial_{c} \bigg[\frac{\exp (cu)}{c} \bigg] \bigg \rvert_{0}^{\infty} \bigg \rvert_{c = -1} = 2a^2 \left[ \frac{u \exp(cu)}{c}  - \frac{\exp(cu)}{c^2} \right] \bigg \rvert_{c = -1} \bigg \rvert_{0}^{\infty}\\
&= 2a^2 \big[- u \exp (-u) - \exp (-u) \big] \rvert_{0}^{\infty} = 2a^{2} \big[0 - (-1) \big] = 2a^2.
\end{align*}

** 2.1.5 Maxwell

\[ p(x) = \sqrt{\frac{2}{\pi a^3}} x^2 \exp \left( -\frac{x^2}{2a^2} \right), \qquad \geq 0 \]

Consider the case where \(a=1\). It's called the standard Maxwell distribution. Instead of the characteristic function, let's first calculate the moment generating function

\begin{aligned}
& m(t) \equiv \int_0^{\infty} \sqrt{\frac{2}{\pi}} x^2 \exp \bigg(\frac{-x^2}{2}\bigg) \exp (t x) d x \\
& =\int_0^{\infty} \sqrt{\frac{2}{\pi}} \exp \bigg(t^2 / 2\bigg) x^2 \exp \bigg(\frac{-(x-t)^2}{2}\bigg) d x \\
& =\sqrt{\frac{2}{\pi}} \exp \bigg(\frac{t^2}{2}\bigg) \int_{-t}^{\infty}(z+t)^2 \exp \big(-z^2 / 2\big) d z \\
& =\sqrt{\frac{2}{\pi}} \exp \bigg(\frac{t^2}{2}\bigg) \int_{-t}^{\infty}\bigg(z^2+2 t z+t^2\bigg) \exp \bigg(\frac{-z^2}{2}\bigg) d z \\
& =\sqrt{\frac{2}{\pi}} \exp \bigg(\frac{t^2}{2}\bigg)\bigg[\int_{-t}^{\infty} z^2 \exp \bigg(\frac{-z^2}{2}\bigg) d z+\int_{-t}^{\infty} 2 t z \exp \bigg(\frac{-z^2}{2}\bigg) d z + t^2 \int_{-t}^{\infty} \exp \big(-z^2 / 2\big) d z\bigg] \\
& =\sqrt{\frac{2}{\pi}} \exp \bigg(\frac{t^2}{2}\bigg)\bigg[-t \exp \bigg(\frac{-t^2}{2}\bigg)+\sqrt{2 \pi} \Phi(t)+2 t \exp \bigg(\frac{-t^2}{2}\bigg) + t^2 \sqrt{2 \pi} \Phi(t)\bigg] \\
& =\sqrt{\frac{2}{\pi}} t+2\bigg(1+t^2\bigg) \exp \bigg(\frac{t^2}{2}\bigg) \Phi(t),
\end{aligned}

where \(\Phi(t)\) is the PDF of the standard normal distribution. We can now retrieve the characteristic function

\begin{aligned}
\tilde{p}(k) = m(- i a k) = - i \sqrt{\frac{2}{\pi}} a k+2\left(1-a^2 k^2\right) \exp \left(\frac{-a^2 k^2}{2}\right) \Phi(- i a k).
\end{aligned}

We resort to using the definition of [[id:0aa35d43-6356-4910-a842-4ed740377570][moments]] to evaluate \(m_{1}\) and \(m_{2}\):

\begin{aligned}
m_1=\langle x\rangle & =\sqrt{\frac{2}{\pi}} \int_0^{\infty} \frac{x^3}{a^3} \exp \left(\frac{-x^2}{2 a^2}\right) d x=2 a \sqrt{\frac{2}{\pi}} \int_0^{\infty} \frac{x^2}{2 a^2} \exp \left(\frac{-x^2}{2 a^2}\right) \mathrm{~d} \bigg(\frac{x^{2}}{2a^2} \bigg) \\
& =2 \sqrt{\frac{2}{\pi}} a \int_0^{\infty} y \exp (-y) d y = 2 \sqrt{\frac{2}{\pi}} a,
\end{aligned}

\begin{aligned}
m_2= \langle x^2 \rangle & =\sqrt{\frac{2}{\pi}} \int_0^{\infty} \frac{x^4}{a^3} \exp \left(-\frac{x^2}{2 a^2}\right) d x=\sqrt{\frac{2}{\pi}} \partial_{a}\left[\int_0^{\infty} x^2 \exp \left(\frac{-x^2}{2 a^2}\right) \mathrm{~d}x \right] \\
& =\sqrt{\frac{2}{\pi}} \thinspace \partial_{a} \left(a^3 \sqrt{\frac{\pi}{2}}\right) = 3 a^2.
\end{aligned}